Revit 2026 API

# FabricationItemFolder Methods

---

The FabricationItemFolder type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetItemFiles | Gets the item files in this item folder. |
|  | GetSubFolders | Gets the item folder's sub folders. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

FabricationItemFolder Class

Autodesk.Revit.DB Namespace